wrk/async_res/wrk_status.txt
Running 20s test @ http://127.0.0.1:8080/v0/status
  2 threads and 1024 connections
  Thread calibration: mean lat.: 1.259ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.19ms  555.97us   4.92ms   64.39%
    Req/Sec     5.24k   506.27     7.33k    69.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.59ms
 90.000%    1.94ms
 99.000%    2.55ms
 99.900%    3.14ms
 99.990%    3.55ms
 99.999%    4.06ms
100.000%    4.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.076     0.000000            1         1.00
       0.488     0.100000         7414         1.11
       0.659     0.200000        14816         1.25
       0.819     0.300000        22238         1.43
       0.978     0.400000        29612         1.67
       1.144     0.500000        37028         2.00
       1.229     0.550000        40718         2.22
       1.316     0.600000        44414         2.50
       1.406     0.650000        48125         2.86
       1.497     0.700000        51818         3.33
       1.589     0.750000        55507         4.00
       1.637     0.775000        57360         4.44
       1.686     0.800000        59232         5.00
       1.742     0.825000        61081         5.71
       1.798     0.850000        62910         6.67
       1.863     0.875000        64762         8.00
       1.899     0.887500        65681         8.89
       1.941     0.900000        66618        10.00
       1.986     0.912500        67549        11.43
       2.033     0.925000        68458        13.33
       2.087     0.937500        69411        16.00
       2.115     0.943750        69851        17.78
       2.147     0.950000        70306        20.00
       2.185     0.956250        70795        22.86
       2.227     0.962500        71239        26.67
       2.275     0.968750        71709        32.00
       2.303     0.971875        71935        35.56
       2.335     0.975000        72163        40.00
       2.371     0.978125        72394        45.71
       2.403     0.981250        72620        53.33
       2.449     0.984375        72857        64.00
       2.475     0.985938        72969        71.11
       2.501     0.987500        73084        80.00
       2.529     0.989062        73200        91.43
       2.569     0.990625        73315       106.67
       2.613     0.992188        73432       128.00
       2.633     0.992969        73487       142.22
       2.659     0.993750        73547       160.00
       2.687     0.994531        73606       182.86
       2.723     0.995313        73661       213.33
       2.769     0.996094        73718       256.00
       2.793     0.996484        73746       284.44
       2.825     0.996875        73776       320.00
       2.857     0.997266        73804       365.71
       2.911     0.997656        73836       426.67
       2.951     0.998047        73863       512.00
       2.969     0.998242        73876       568.89
       3.015     0.998437        73892       640.00
       3.047     0.998633        73905       731.43
       3.107     0.998828        73920       853.33
       3.149     0.999023        73936      1024.00
       3.177     0.999121        73943      1137.78
       3.199     0.999219        73950      1280.00
       3.221     0.999316        73956      1462.86
       3.243     0.999414        73963      1706.67
       3.281     0.999512        73970      2048.00
       3.295     0.999561        73974      2275.56
       3.313     0.999609        73978      2560.00
       3.319     0.999658        73981      2925.71
       3.329     0.999707        73985      3413.33
       3.365     0.999756        73988      4096.00
       3.437     0.999780        73990      4551.11
       3.447     0.999805        73992      5120.00
       3.469     0.999829        73994      5851.43
       3.497     0.999854        73996      6826.67
       3.521     0.999878        73997      8192.00
       3.533     0.999890        73998      9102.22
       3.549     0.999902        73999     10240.00
       3.579     0.999915        74000     11702.86
       3.675     0.999927        74001     13653.33
       3.699     0.999939        74002     16384.00
       3.699     0.999945        74002     18204.44
       3.737     0.999951        74003     20480.00
       3.737     0.999957        74003     23405.71
       3.865     0.999963        74004     27306.67
       3.865     0.999969        74004     32768.00
       3.865     0.999973        74004     36408.89
       4.063     0.999976        74005     40960.00
       4.063     0.999979        74005     46811.43
       4.063     0.999982        74005     54613.33
       4.063     0.999985        74005     65536.00
       4.063     0.999986        74005     72817.78
       4.923     0.999988        74006     81920.00
       4.923     1.000000        74006          inf
#[Mean    =        1.189, StdDeviation   =        0.556]
#[Max     =        4.920, Total count    =        74006]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  186836 requests in 20.00s, 11.05MB read
  Socket errors: connect 5, read 0, write 0, timeout 40
Requests/sec:   9341.44
Transfer/sec:    565.59KB