wrk/async_res/wrk_status_under_put.txt
Running 20s test @ http://127.0.0.1:8080/v0/status
  2 threads and 1024 connections
  Thread calibration: mean lat.: 1.074ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.570ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  766.75us  15.30ms   77.77%
    Req/Sec     5.24k     3.56k   22.00k    93.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.42ms
 90.000%    2.03ms
 99.000%    3.80ms
 99.900%    4.76ms
 99.990%   14.56ms
 99.999%   15.14ms
100.000%   15.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            2         1.00
       0.366     0.100000         7395         1.11
       0.553     0.200000        14795         1.25
       0.718     0.300000        22218         1.43
       0.874     0.400000        29623         1.67
       1.023     0.500000        37004         2.00
       1.097     0.550000        40686         2.22
       1.172     0.600000        44389         2.50
       1.247     0.650000        48063         2.86
       1.323     0.700000        51753         3.33
       1.417     0.750000        55463         4.00
       1.476     0.775000        57304         4.44
       1.550     0.800000        59162         5.00
       1.640     0.825000        61010         5.71
       1.744     0.850000        62846         6.67
       1.872     0.875000        64698         8.00
       1.942     0.887500        65618         8.89
       2.025     0.900000        66545        10.00
       2.117     0.912500        67471        11.43
       2.241     0.925000        68395        13.33
       2.399     0.937500        69329        16.00
       2.489     0.943750        69776        17.78
       2.589     0.950000        70242        20.00
       2.697     0.956250        70703        22.86
       2.845     0.962500        71165        26.67
       3.021     0.968750        71624        32.00
       3.121     0.971875        71855        35.56
       3.219     0.975000        72092        40.00
       3.317     0.978125        72317        45.71
       3.425     0.981250        72549        53.33
       3.535     0.984375        72778        64.00
       3.599     0.985938        72894        71.11
       3.673     0.987500        73011        80.00
       3.751     0.989062        73125        91.43
       3.827     0.990625        73242       106.67
       3.921     0.992188        73358       128.00
       3.985     0.992969        73416       142.22
       4.045     0.993750        73470       160.00
       4.103     0.994531        73530       182.86
       4.159     0.995313        73587       213.33
       4.211     0.996094        73645       256.00
       4.251     0.996484        73675       284.44
       4.283     0.996875        73704       320.00
       4.323     0.997266        73730       365.71
       4.367     0.997656        73759       426.67
       4.403     0.998047        73788       512.00
       4.447     0.998242        73803       568.89
       4.479     0.998437        73818       640.00
       4.527     0.998633        73831       731.43
       4.639     0.998828        73848       853.33
       4.811     0.999023        73860      1024.00
       5.007     0.999121        73868      1137.78
       5.203     0.999219        73875      1280.00
       5.407     0.999316        73882      1462.86
       6.411     0.999414        73889      1706.67
       7.379     0.999512        73896      2048.00
       8.223     0.999561        73900      2275.56
       8.823     0.999609        73904      2560.00
       9.135     0.999658        73907      2925.71
      10.255     0.999707        73911      3413.33
      11.559     0.999756        73914      4096.00
      12.455     0.999780        73916      4551.11
      13.647     0.999805        73918      5120.00
      13.911     0.999829        73920      5851.43
      14.431     0.999854        73923      6826.67
      14.431     0.999878        73923      8192.00
      14.447     0.999890        73924      9102.22
      14.559     0.999902        73925     10240.00
      14.591     0.999915        73926     11702.86
      14.719     0.999927        73927     13653.33
      14.791     0.999939        73928     16384.00
      14.791     0.999945        73928     18204.44
      14.911     0.999951        73929     20480.00
      14.911     0.999957        73929     23405.71
      14.983     0.999963        73930     27306.67
      14.983     0.999969        73930     32768.00
      14.983     0.999973        73930     36408.89
      15.143     0.999976        73931     40960.00
      15.143     0.999979        73931     46811.43
      15.143     0.999982        73931     54613.33
      15.143     0.999985        73931     65536.00
      15.143     0.999986        73931     72817.78
      15.303     0.999988        73932     81920.00
      15.303     1.000000        73932          inf
#[Mean    =        1.145, StdDeviation   =        0.767]
#[Max     =       15.296, Total count    =        73932]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  185707 requests in 20.00s, 10.98MB read
  Socket errors: connect 5, read 0, write 0, timeout 40
Requests/sec:   9285.01
Transfer/sec:    562.18KB